{"Asset":{"i9d26b81f4fl1ebn":{"source":"source\\about-me\\meandannie.jpg","mtime":1401027524000,"modified":true,"_id":"i9d26b81f4fl1ebn","full_source":"C:\\Users\\Adam\\Documents\\workspace\\GitHub\\hexo-blog\\source\\about-me\\meandannie.jpg","path":"about-me/meandannie.jpg"},"eh38fdzv95ht2v6j":{"source":"source\\images\\self.png","mtime":1400173788000,"modified":true,"_id":"eh38fdzv95ht2v6j","full_source":"C:\\Users\\Adam\\Documents\\workspace\\GitHub\\hexo-blog\\source\\images\\self.png","path":"images/self.png"}},"Cache":{"uuxtyh91876hf3ab":{"content":"title: about me\ntags:\n- me\n- development\n- JavaScript\n---\n### My name is Adam and I am a developer\n\nJust a quick introduction. My name is Adam, I am a developer for the Access Group and I work mainly on front-end projects. HTML, CSS, JavaScript, JavaScript and JavaScript are the day to day areas I work in.\n\n![Me and Annie][8]\n\n### Technical stuff I'm interested in\n\nFrom a technical point of view my interests are modern Front-end development tools and techniques. Some stand outs to me are:\n\n - [Chrome DevTools][1], this really helped me unlock my understanding of the browser.\n - [Grunt][2], an amazing tool that gave me a great 'in' into [Node][3]. Well thought out automation is incredible and can help raise the standards of code being produced by an immeasurable amount.\n - JavaScript powered static site generators, this site is generated by [hexo][4], but I've looked at quite a few others before finding hexo.\n - [Angular][5], is one of a few MV* style frameworks I've used. With each of the frameworks and libraies I've used I've found that it has been an opportunity to learn more about JavaScript. For example after building an app in Angular I have a much better understanding of memory locations.\n - [IFTTT][6] more automation, this time taking advantage of the APIs available from sites, services and devices to listen for triggers and take actions.\n\n### Non-technical\n\nI recently married this incredible woman [anniewalton.co.uk][7]. I'm still amazed by the wonderful vision she had for our wedding and in awe of everything she accomplished on the day, in all honesty I was in awe before the wedding and still in awe.\n\n### blogging\n\nThe main purpose of this blog is a selfish one. It's to help me develop ideas and my understanding. To use a different part of my brain while writing and finally to have a site I can use in anger, to play with and develop.\n\nSo that's a quick insight into me and this blog my name is Adam and I am a developer.\n\n  [1]: https://developer.chrome.com/devtools/index\n  [2]: http://gruntjs.com/\n  [3]: http://nodejs.org/\n  [4]: http://hexo.io/\n  [5]: https://angularjs.org/\n  [6]: http://ifttt.com/\n  [7]: http://anniewalton.co.uk/\n  [8]: meandannie.jpg","mtime":1401027524000,"source":"source\\about-me\\index.md","_id":"uuxtyh91876hf3ab"},"m9vocwb6v28i9vwa":{"content":"title: Kevin Marks and the Indie web\ndate: 2014-05-10 22:24:50\ntags:\n- development\n---\nFirst up here is Kevin Marks' talk on \"the web we found\"; the web 10 years ago, the web today and the future of the web at LeWeb'13.\n\n<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/Ve48PjgDAn0\" frameborder=\"0\" allowfullscreen></iframe>\n\nThe talk starts by looking at the web in 2003 and a compares it to the web in 2013. This was just the background and foundation to lay out the ideas of the indie web and the future of the web.\n\n### The bit I found really relevant\n\nWhen Marks was discussing the future of the web one of the points that resonated with me was about building tools that you want to use. I think this idea will colour most of the decisions about how this blog engine is developed (for now). It's easy to go down a rabbit hole of second guessing what other people want in a tool. But while it's just me, I'll stick to a few rules of thumb:\n\n - In the core development, I'm not going to worry too much about breaking what I already have.\n - With one big caveat, when I update the the distribution version of the engine that is powering this blog I'm not going to overwrite any theming or content I already have here.\n - Going from writing a new post to publishing, I want that to take minimal steps. Ideally one but I've not decided on grunt powered commits.\n\n### Bonus Feature\n\nHere is a follow-up interview with Kevin Marks where he discuss and expands on some of the ideas from his presentation and gives a bit of background on the history of video and the web.\n\n<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/T1kfKV4Yjhs\" frameborder=\"0\" allowfullscreen></iframe>","mtime":1399761531000,"source":"source\\_posts\\indie web.md","_id":"m9vocwb6v28i9vwa"},"n4ucjx72pxrwdffv":{"content":"title: From Bootstrap: How to make a point with CSS\ntags:\n- CSS\n- Bootstrap\n---\n\nSomething I noticed while digging around in bootstrap was how they added a point to a dropdown menu. I thought I'd demo a simplified version of the steps to get there. In Bootstrap the point is created using a pseudo element and also takes advantage of ```background-clip```, but I'll be keeping things simple here.\n\n1) Start with an element (div) and add a border\n\n\n2) Each side of the border is connected at either end by a mitre joint. This is what is taken advantage of To create the pointer look.\n\n\n3) The height and width of an element is the internal size of that element, the border is calculated on top of that. So the border will still be drawn even when the height and width are both set to 0. I've also increased the size of the border here.\n\n\n4) Final step is to make 3 of the sides transparent and the ```background-color``` transparent. This leaves you with a pointer.\n\n\nYou don't have to have an equilateral triangle, by changing the widths of the 2 adjacent sides you can create a variety of triangular shapes. The demos all have a ```border-top-width``` of 20px.\n\n\n\n {% jsfiddle 6gy3F result,html,css %}","mtime":1399761476000,"source":"source\\_posts\\From_Bootstrap_How_to_make_a_point_with_CSS.md","_id":"n4ucjx72pxrwdffv"}}}